export const updates = [
  {
    date: '2026-1-4',
    content: [
      '开放歌单投稿！如果你有推荐的学习歌单和单曲，可以投稿主包的邮箱shshouse@mikugame.icu，主包更新时会挑选添加到歌单页！',
      '学习辛苦了！这个时候应该差不多放寒假了吧，在寒假里Miku也会一直陪着大家的',
      '1.将移动端“全屏”按钮的效果修改为全屏+横屏',
      '2.有家人反映夸克打开网站是视频或者打不开，这是因为夸克搞了个什么云加速(并非加速)。使用edge浏览器效果最佳！',
      '3.修复学习和休息结束时的通知错误',
      '4.在番茄钟设置页添加了完成专注/休息后是否暂停音乐的选项',
      '5.如果你有推荐的学习歌单或者单曲，可以投稿主包的邮箱里，要求是Bpm低的和悠闲治愈的风格',
      '希望收到你的投稿＞﹏＜！请在投稿时附上您的昵称'
    ]
  },
  {
    date: '2026-1-2',
    content: [
      '新年快乐！希望在新的一年大家可以继续Study With Miku~',
      '不知道大家的学习数据怎么样了，主包自己是77小时，大家可以在获取歌单id的文章下面晒出自己的学习数据截图喔~',
      '1.真正修复了手机端"全屏""切换"按钮显示问题，感谢@gxxk-dev的贡献',
      '2.为滚动条样式自定义了样式'
    ]
  },
  {
    date: '2025-12-27',
    content: [
      '学习辛苦了！也请注意一下休息哦~',
      '1.对默认歌单添加了翻译，找歌更方便~',
      '2.修复手机端的ui显示不全问题',
      '3.修复手机端的"全屏""切换"按钮显示问题'
    ]
  },
  {
    date: '2025-12-19',
    content: [
      '网站即将满月，感谢大家的使用!',
      '1.账号系统制作中，以后可以登录MikuMod账号，记录学习时长等',
      '2.学习时长记录推出！可以记录学习了多久以及完成的番茄数~',
      '3.桌面壁纸应用即将推出~'
    ]
  }
]
