export const updates = [
    {
    date: '2026-2-25',
    content: [
      '1.新增“-千禧2k-”的歌单，感谢投稿~',
      '2.新增 一言 功能，在学习中会出现激励',
      '如果你也有希望推荐的歌单，一言，建议',
      '可以投稿到邮箱shshouse@mikumod.com',
      '--------',
      '学生党应该马上开学了吧，希望高三党好好冲刺！希望主包这样的上班族活下去（迫真）！',
      '那么，在新的日子里，也请好好对待自己，Miku将继续陪伴着你。',
    ]
  },
  {
    date: '2026-2-23',
    content: [
      'B站的 @刚***酸 私信反馈了移动端在全屏下无法自动旋转的问题',
      '1.感谢反馈！问题已经修复！另外你的画非常可爱！主包非常喜欢！',
      '2.在关于页添加了 @闻柒有点懵 的友情链接！欢迎大家也去闻柒酱那边看看！',
      '小杂鱼们的寒假作业做完了吗~在赶作业的同时也要注意休息！',
      '实在赶不完的话。。。就放弃吧！主包从小到大就没写完过假期作业（并非骄傲ヽ(✿ﾟ▽ﾟ)ノ',
      '@刚***酸 的画(超级可爱！)：',
    ],
    images: [
      '/kawaii.jpg',
    ]
  },
  {
    date: '2026-2-17',
    content: [
      'B站的 @R***1 在视频下留言了苹果端在未播放音乐时计时结束铃声不播放的bug',
      '感谢反馈！由于主包没有苹果设备，只能猜测大概原因来尝试修复，可以试试现在正常了吗',
      '如果大家有遇到问题也可以在视频下留言，主包高强度刷B的',
      '或者发邮件到shshouse@mikumod.com，主包都会回复的！',
      '歌单也是投到这个邮箱＞﹏＜',
    ]
  },
  {
    date: '2026-2-14',
    content: [
      '本次更新主要是修复了移动端的很多问题！抱歉拖这么久ㄒoㄒ',
      '1.优化移动端设置页布局',
      '2.修复移动端中央字体过大问题',
      '3.彻底修复阶段结束时计时卡住的问题！',
      '4.修复第二张背景移动端无法正常播放问题',
      '其他更新：',
      '1.开启了歌词显示功能，现在如果歌曲有歌词的话，就会显示歌词了',
      '2.新增更新点提示，如果哪个地方会有红点提示',
    ]
  },
  {
    date: '2026-2-13',
    content: [
      '请之前给主包发过邮件的小伙伴再发一次！窝不小心丢失了之前的所有邮件',
      '非常抱歉！主包不是故意弄丢你们的心意/(ㄒoㄒ)/~~，请如果看到了务必再复制发一次，主包一定回复！',
      '------',
      '更新：',
      '1.PWA修复！这下应该是真的可以用了！',
      '2.有一位朋友的反馈是移动端的计时会停止，窝在本次更新中修复了这个问题',
      '3.歌单新增‘炤华夕逝’朋友的歌单！欢迎收听',
      '4.优化部分字体在移动端过大的问题，可能还会有调整',
      '5.把复制歌单id改为了直接跳转到对应歌单！',
      '音乐投稿邮箱：shshouse@mikumod.com，欢迎投稿！（其实想闲聊也行，主包都会回信＞﹏＜）',
      '------',
      '碎碎念：',
      '好忙啊~似乎已经很久没有打游戏的心情了，有点羡慕主包的一个朋友，经常能看到steam在线',
      '总感觉好像闲下来就是在浪费时间什么的，毕竟玩游戏确实好像没什么现实的收益',
      '害还能咋办呢，继续过呗',
      '那么还是希望你可以喜欢和Miku在一起的学习时光！Enjoy It！',
      'PS：主包现在的学习时间累计298小时了，挂机万岁！',
    ]
  },
  {
    date: '2026-1-18',
    content: [
      '寒假快乐！无论是学生亦或是和主包一样的上班族，都辛苦了！',
      '话说主包自己的学习时间都已经到了178小时哩＞﹏＜',
      '------',
      '更新：',
      '1.添加PWA支持！现在浏览器应该会显示“当前网站有应用”，也就是可以安装到本地运行了！',
      '2.添加代办列表！可以将代办事项写上去了！默认显示最老的一条待办，也可以自己设置显示什么代办~',
      '3.歌单页面大改动！收到了小伙伴"阿氏圆"的古典音乐投稿，已经添加到歌单中，感谢投稿！',
      '音乐投稿邮箱：shshouse@mikumod.com，欢迎投稿！（其实想闲聊也行，主包都会回信＞﹏＜）',
      '------',
      '一些碎碎念：',
      '主包对现在的状况很满意了，每天上线看到20多，60多人在线，还有可爱的Miku就充满了干劲呢',
      '虽然咱这不太热闹，和这喧嚣的互联网不太一样，但是也挺好的不是嘛',
      '希望你可以喜欢和Miku在一起的时光！请在悠闲的音乐里和Miku一起学习工作吧~',
    ]
  },
  {
    date: '2026-1-4',
    content: [
      '开放歌单投稿！如果你有推荐的学习歌单和单曲，可以投稿主包的邮箱shshouse@mikumod.com，主包更新时会挑选添加到歌单页！',
      '学习辛苦了！这个时候应该差不多放寒假了吧，在寒假里Miku也会一直陪着大家的',
      '1.将移动端“全屏”按钮的效果修改为全屏+横屏',
      '2.有家人反映夸克打开网站是视频或者打不开，这是因为夸克搞了个什么云加速(并非加速)。使用edge浏览器效果最佳！',
      '3.修复学习和休息结束时的通知错误',
      '4.在番茄钟设置页添加了完成专注/休息后是否暂停音乐的选项',
      '5.如果你有推荐的学习歌单或者单曲，可以投稿主包的邮箱里，要求是Bpm低的和悠闲治愈的风格',
      '希望收到你的投稿＞﹏＜！请在投稿时附上您的昵称'
    ]
  },
  {
    date: '2026-1-2',
    content: [
      '新年快乐！希望在新的一年大家可以继续Study With Miku~',
      '不知道大家的学习数据怎么样了，主包自己是77小时，大家可以在获取歌单id的文章下面晒出自己的学习数据截图喔~',
      '1.真正修复了手机端"全屏""切换"按钮显示问题，感谢@gxxk-dev的贡献',
      '2.为滚动条样式自定义了样式'
    ]
  },
  {
    date: '2025-12-27',
    content: [
      '学习辛苦了！也请注意一下休息哦~',
      '1.对默认歌单添加了翻译，找歌更方便~',
      '2.修复手机端的ui显示不全问题',
      '3.修复手机端的"全屏""切换"按钮显示问题'
    ]
  },
  {
    date: '2025-12-19',
    content: [
      '网站即将满月，感谢大家的使用!',
      '1.账号系统制作中，以后可以登录MikuMod账号，记录学习时长等',
      '2.学习时长记录推出！可以记录学习了多久以及完成的番茄数~',
      '3.桌面壁纸应用即将推出~'
    ]
  }
]

export const LATEST_UPDATE_VERSION = updates[0].date
